feat: news pipeline update (#5814)
* Delete .github/workflows/pr-create-website-news.yml

* Add new workflows

* Delete .github/scripts/pr_create_website_news.py

* Add new scripts

* Enhance workflows for news and highlights management

Added new workflows for highlights and README updates.

* Change mermaid chart themes to 'dark'

Updated mermaid chart themes from 'neutral' to 'dark' for better visibility.

* fix minor issues Review=True
